---
kind: method
id: M:Autodesk.Revit.DB.FabricationConfiguration.CustomDataExists(System.Int32)
source: html/3b4d7726-f4de-f10f-4a14-8cf4a3912a4d.htm
---
# Autodesk.Revit.DB.FabricationConfiguration.CustomDataExists Method

Checks to see if the specified custom data exists.

## Syntax (C#)
```csharp
public bool CustomDataExists(
	int customDataId
)
```

## Parameters
- **customDataId** (`System.Int32`) - The custom data identifier.

## Returns
Returns true if the custom data exists.